Revit 2027 API
BuiltInFailures.InaccurateFailures.InaccurateRoomSeparation Property
 Room separation line is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InaccurateRoomSeparation { get; }
Public Shared ReadOnly Property InaccurateRoomSeparation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InaccurateRoomSeparation {
	FailureDefinitionId^ get ();
}
static member InaccurateRoomSeparation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace